app/controllers/graph_controller.rb

SELECT states.score,users.name as name,states.userid as id FROM `states` JOIN users ON users.id=states.userid WHERE `states`.`subgenre` = 'Books' AND `states`.`genre` = 'Entertainment' ORDER BY `states`.`score` DESC
---
  def getchart
  	@qry=State.where(subgenre: $cur_subgen,genre: $cur_gen).joins("JOIN users ON users.id=states.userid").select('states.score,users.name as name,states.userid as id').order(score: :desc).uniq.pluck(:name,:score)