app/controllers/leaderboard_controller.rb

SELECT states.score,users.name as name,states.userid as id FROM `states` JOIN users ON users.id=states.userid WHERE `states`.`genre` = 'First' ORDER BY `states`.`score` DESC
---
  def bygen
  	  $lbqgen=State.where(genre: params["gennm"]).joins("JOIN users ON users.id=states.userid").select('states.score,users.name as name,states.userid as id').order(score: :desc).uniq.pluck(:name,:score)

SELECT states.score,users.name as name,states.userid as id FROM `states` JOIN users ON users.id=states.userid WHERE `states`.`subgenre` = 'GHI' ORDER BY `states`.`score` DESC
---
  def bysubgen
  	  print params
	  $lbqsubgen=State.where(subgenre: params["subgennm"]).joins("JOIN users ON users.id=states.userid").select('states.score,users.name as name,states.userid as id').order(score: :desc).uniq.pluck(:name,:score)