app/controllers/states_controller.rb

  def index
    @states = State.all
---
SELECT `states`.* FROM `states`