app/controllers/sub_genres_controller.rb

  def index
    @sub_genres = SubGenre.all
---
SELECT `sub_genres`.* FROM `sub_genres`

  def create
    $quiz_show_subgen=SubGenre.where(gen: $quiz_top_gen)
    if params[:sub_genre][:subgen] == ""
      redirect_to new_sub_genre_path ,alert: "All field are necessary!"
    else
      @sub_genre = SubGenre.new(sub_genre_params_crt)

      respond_to do |format|
        if @sub_genre.save
---
INSERT INTO `sub_genres` (`subgen`, `gen`, `created_at`, `updated_at`) VALUES ('ABC', 'First', '2017-09-11 16:06:42', '2017-09-11 16:06:42')

  def destroy
    Mcq.where(subgen: @sub_genre.subgen).destroy_all();
---
DELETE FROM `mcqs` WHERE `mcqs`.`id` = 3
DELETE FROM `sub_genres` WHERE `sub_genres`.`id` = 3
SELECT `mcqs`.* FROM `mcqs` WHERE `mcqs`.`subgen` = 'ABC'

    def set_sub_genre
      @sub_genre = SubGenre.find(params[:id])
---
SELECT  `sub_genres`.* FROM `sub_genres` WHERE `sub_genres`.`id` = 3 LIMIT 1