app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    if session[:user_name]=="Admin"
      @users = User.all

SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'Kushal' LIMIT 1
INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES ('Kushal', '$2a$10$MyKmYASoGtGvhj32uuTQUe0WHMVWahvgoPGwXFjK2f9IWrwKWiwi.', '2017-09-10 19:26:53', '2017-09-10 19:26:53')
---
  def create
    if User.find_by(name: (params[:user])[:name])
      redirect_to new_user_path,alert:"User with name already exsists"
    else
      @user = User.new(user_params)

      respond_to do |format|
        if @user.save

UPDATE `users` SET `password_digest` = '$2a$10$.SU.9O8MPrmuf56m9GKqT.j4Ft4qm7rPftBxHT6uH8aaOtYHP6JWS', `updated_at` = '2017-09-11 13:47:45' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
    def set_user
      @user = User.find(params[:id])